### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_named_value.io_p_messages_sending_func_key_itn will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/io-p-messages-sending-func-key")
  ~ resource "azurerm_api_management_named_value" "io_p_messages_sending_func_key_itn" {
        api_management_name = "io-p-itn-apim-01"
        display_name        = "io-p-messages-sending-func-key"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/io-p-messages-sending-func-key"
        name                = "io-p-messages-sending-func-key"
        resource_group_name = "io-p-itn-common-rg-01"
        secret              = true
        tags                = []
      + value               = (sensitive value)
    }

  # module.mongo.azurerm_cosmosdb_mongo_database.db_payments will be imported
    resource "azurerm_cosmosdb_mongo_database" "db_payments" {
        account_name        = "io-p-payments-mongodb-account"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account/mongodbDatabases/db"
        name                = "db"
        resource_group_name = "io-p-itn-com-rg-01"
        throughput          = 400

        autoscale_settings {
            max_throughput = 2000
        }
    }

  # module.mongo.azurerm_cosmosdb_mongo_database.db_reminder will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account/mongodbDatabases/db")
  ~ resource "azurerm_cosmosdb_mongo_database" "db_reminder" {
        account_name        = "io-p-messages-reminder-mongodb-account"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account/mongodbDatabases/db"
        name                = "db"
        resource_group_name = "io-p-itn-com-rg-01"
        throughput          = 2000

      ~ autoscale_settings {
          ~ max_throughput = 20000 -> 4000
        }
    }

  # module.mongo.azurerm_key_vault_secret.mongodb_payments_connection_string will be imported
    resource "azurerm_key_vault_secret" "mongodb_payments_connection_string" {
        content_type            = null
        id                      = "https://io-p-itn-com-kv-01.vault.azure.net/secrets/paymentup-mongo-connection-string/6ff42f4d5f0a4dc5a2f0684c178f3537"
        key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01"
        name                    = "paymentup-mongo-connection-string"
        resource_id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01/secrets/paymentup-mongo-connection-string/versions/6ff42f4d5f0a4dc5a2f0684c178f3537"
        resource_versionless_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01/secrets/paymentup-mongo-connection-string"
        tags                    = {}
        value                   = (sensitive value)
        value_wo_version        = 0
        version                 = "6ff42f4d5f0a4dc5a2f0684c178f3537"
        versionless_id          = "https://io-p-itn-com-kv-01.vault.azure.net/secrets/paymentup-mongo-connection-string"
    }

  # module.mongo.azurerm_key_vault_secret.mongodb_reminder_connection_string will be imported
    resource "azurerm_key_vault_secret" "mongodb_reminder_connection_string" {
        content_type            = null
        id                      = "https://io-p-itn-com-kv-01.vault.azure.net/secrets/reminder-mongo-connection-string/f54d9211e926470fa3a19e241d665634"
        key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01"
        name                    = "reminder-mongo-connection-string"
        resource_id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01/secrets/reminder-mongo-connection-string/versions/f54d9211e926470fa3a19e241d665634"
        resource_versionless_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01/secrets/reminder-mongo-connection-string"
        tags                    = {}
        value                   = (sensitive value)
        value_wo_version        = 0
        version                 = "f54d9211e926470fa3a19e241d665634"
        versionless_id          = "https://io-p-itn-com-kv-01.vault.azure.net/secrets/reminder-mongo-connection-string"
    }

  # module.mongo.module.cosmosdb_account_mongodb_payments.azurerm_cosmosdb_account.this will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account")
  ~ resource "azurerm_cosmosdb_account" "this" {
        access_key_metadata_writes_enabled           = true
        analytical_storage_enabled                   = false
        automatic_failover_enabled                   = true
        burst_capacity_enabled                       = false
        create_mode                                  = "Default"
        default_identity_type                        = "FirstPartyIdentity"
        endpoint                                     = "https://io-p-payments-mongodb-account.documents.azure.com:443/"
        free_tier_enabled                            = false
        id                                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account"
        ip_range_filter                              = []
        is_virtual_network_filter_enabled            = false
        kind                                         = "MongoDB"
        local_authentication_disabled                = false
        location                                     = "westeurope"
      ~ minimal_tls_version                          = "Tls" -> "Tls12"
        mongo_server_version                         = "4.0"
        multiple_write_locations_enabled             = false
        name                                         = "io-p-payments-mongodb-account"
        network_acl_bypass_for_azure_services        = false
        network_acl_bypass_ids                       = []
        offer_type                                   = "Standard"
        partition_merge_enabled                      = false
        primary_key                                  = (sensitive value)
        primary_mongodb_connection_string            = (sensitive value)
        primary_readonly_key                         = (sensitive value)
        primary_readonly_mongodb_connection_string   = (sensitive value)
        public_network_access_enabled                = false
        read_endpoints                               = [
            "https://io-p-payments-mongodb-account-italynorth.documents.azure.com:443/",
            "https://io-p-payments-mongodb-account-spaincentral.documents.azure.com:443/",
        ]
        resource_group_name                          = "io-p-itn-com-rg-01"
        secondary_key                                = (sensitive value)
        secondary_mongodb_connection_string          = (sensitive value)
        secondary_readonly_key                       = (sensitive value)
        secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ tags                                         = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
          ~ "Source"         = "https://github.com/pagopa/io-infra/tree/main/src/payments-common" -> "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        write_endpoints                              = [
            "https://io-p-payments-mongodb-account-italynorth.documents.azure.com:443/",
        ]

        analytical_storage {
            schema_type = "FullFidelity"
        }

        backup {
            interval_in_minutes = 0
            retention_in_hours  = 0
            storage_redundancy  = null
            tier                = "Continuous30Days"
            type                = "Continuous"
        }

        capabilities {
            name = "EnableMongo"
        }

        consistency_policy {
            consistency_level       = "Session"
            max_interval_in_seconds = 5
            max_staleness_prefix    = 100
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "io-p-payments-mongodb-account-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-payments-mongodb-account-spaincentral" -> null
          - location          = "spaincentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "westeurope"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }

        identity {
            identity_ids = []
            principal_id = "77eed8ce-4d0a-47c5-bacd-608c8c7b4ec2"
            tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d"
            type         = "SystemAssigned"
        }
    }

  # module.mongo.module.cosmosdb_account_mongodb_payments.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      + auto_mitigate            = false
      + description              = "A collection throughput (RU/s) exceed provisioned throughput, and it's raising 429 errors. Please, consider to increase RU. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[PAYMENTS | io-p-payments-mongodb-account] Provisioned Throughput Exceeded"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account",
        ]
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "westeurope",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.mongo.module.cosmosdb_account_mongodb_payments.azurerm_private_endpoint.mongo[0] will be created
  + resource "azurerm_private_endpoint" "mongo" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "io-p-payments-mongodb-account-private-endpoint-mongo"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.mongo.cosmos.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-payments-mongodb-account-private-endpoint-mongo"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "MongoDB",
            ]
        }
    }

  # module.mongo.module.cosmosdb_account_mongodb_reminder.azurerm_cosmosdb_account.this will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account")
  ~ resource "azurerm_cosmosdb_account" "this" {
        access_key_metadata_writes_enabled           = true
        analytical_storage_enabled                   = false
        automatic_failover_enabled                   = true
        burst_capacity_enabled                       = false
        create_mode                                  = "Default"
        default_identity_type                        = "FirstPartyIdentity"
        endpoint                                     = "https://io-p-messages-reminder-mongodb-account.documents.azure.com:443/"
        free_tier_enabled                            = false
        id                                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account"
        ip_range_filter                              = []
        is_virtual_network_filter_enabled            = false
        kind                                         = "MongoDB"
        local_authentication_disabled                = false
        location                                     = "westeurope"
      ~ minimal_tls_version                          = "Tls" -> "Tls12"
        mongo_server_version                         = "4.0"
        multiple_write_locations_enabled             = false
        name                                         = "io-p-messages-reminder-mongodb-account"
        network_acl_bypass_for_azure_services        = false
        network_acl_bypass_ids                       = []
        offer_type                                   = "Standard"
        partition_merge_enabled                      = false
        primary_key                                  = (sensitive value)
        primary_mongodb_connection_string            = (sensitive value)
        primary_readonly_key                         = (sensitive value)
        primary_readonly_mongodb_connection_string   = (sensitive value)
        public_network_access_enabled                = false
        read_endpoints                               = [
            "https://io-p-messages-reminder-mongodb-account-italynorth.documents.azure.com:443/",
            "https://io-p-messages-reminder-mongodb-account-spaincentral.documents.azure.com:443/",
        ]
        resource_group_name                          = "io-p-itn-com-rg-01"
        secondary_key                                = (sensitive value)
        secondary_mongodb_connection_string          = (sensitive value)
        secondary_readonly_key                       = (sensitive value)
        secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ tags                                         = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
          ~ "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/messages-common" -> "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        write_endpoints                              = [
            "https://io-p-messages-reminder-mongodb-account-italynorth.documents.azure.com:443/",
        ]

        analytical_storage {
            schema_type = "FullFidelity"
        }

        backup {
            interval_in_minutes = 0
            retention_in_hours  = 0
            storage_redundancy  = null
            tier                = "Continuous30Days"
            type                = "Continuous"
        }

        capabilities {
            name = "EnableMongo"
        }

        consistency_policy {
            consistency_level       = "Session"
            max_interval_in_seconds = 5
            max_staleness_prefix    = 100
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "io-p-messages-reminder-mongodb-account-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-messages-reminder-mongodb-account-spaincentral" -> null
          - location          = "spaincentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "westeurope"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }

        identity {
            identity_ids = []
            principal_id = "15aa4493-db0e-4cdb-b0f8-61b96c62cccc"
            tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d"
            type         = "SystemAssigned"
        }
    }

  # module.mongo.module.cosmosdb_account_mongodb_reminder.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      + auto_mitigate            = false
      + description              = "A collection throughput (RU/s) exceed provisioned throughput, and it's raising 429 errors. Please, consider to increase RU. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[messages | io-p-messages-reminder-mongodb-account] Provisioned Throughput Exceeded"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account",
        ]
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "westeurope",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.mongo.module.cosmosdb_account_mongodb_reminder.azurerm_private_endpoint.mongo[0] will be created
  + resource "azurerm_private_endpoint" "mongo" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "io-p-messages-reminder-mongodb-account-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.mongo.cosmos.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-messages-reminder-mongodb-account-private-endpoint"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "MongoDB",
            ]
        }
    }

  # module.mongo.module.mongdb_collection_payment_retry.azurerm_cosmosdb_mongo_collection.this will be imported
    resource "azurerm_cosmosdb_mongo_collection" "this" {
        account_name           = "io-p-payments-mongodb-account"
        analytical_storage_ttl = 0
        database_name          = "db"
        id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account/mongodbDatabases/db/collections/payment-retry"
        name                   = "payment-retry"
        resource_group_name    = "io-p-itn-com-rg-01"
        system_indexes         = [
            {
                keys   = [
                    "_id",
                ]
                unique = true
            },
        ]
        throughput             = 0

        index {
            keys   = [
                "_id",
            ]
            unique = true
        }
        index {
            keys   = [
                "payeeFiscalCode",
                "noticeNumber",
            ]
            unique = false
        }
        index {
            keys   = [
                "rptId",
            ]
            unique = false
        }
    }

  # module.mongo.module.mongdb_collection_payment_retry.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "mongodb-collection-payment-retry-lock"
      + notes      = "This items can't be deleted in this subscription!"
      + scope      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account/mongodbDatabases/db/collections/payment-retry"
    }

  # module.mongo.module.mongdb_collection_payment_sharded.azurerm_cosmosdb_mongo_collection.this will be imported
    resource "azurerm_cosmosdb_mongo_collection" "this" {
        account_name           = "io-p-payments-mongodb-account"
        analytical_storage_ttl = 0
        database_name          = "db"
        id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-payments-mongodb-account/mongodbDatabases/db/collections/payment-sharded"
        name                   = "payment-sharded"
        resource_group_name    = "io-p-itn-com-rg-01"
        shard_key              = "rptId"
        system_indexes         = [
            {
                keys   = [
                    "_id",
                ]
                unique = true
            },
        ]
        throughput             = 0

        index {
            keys   = [
                "_id",
            ]
            unique = true
        }
        index {
            keys   = [
                "content_paymentData_payeeFiscalCode",
                "content_paymentData_noticeNumber",
            ]
            unique = false
        }
        index {
            keys   = [
                "rptId",
            ]
            unique = false
        }
    }

  # module.mongo.module.mongdb_collection_reminder_sharded.azurerm_cosmosdb_mongo_collection.this must be replaced
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account/mongodbDatabases/db/collections/reminder-sharded-new")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_cosmosdb_mongo_collection" "this" {
        account_name           = "io-p-messages-reminder-mongodb-account"
      - analytical_storage_ttl = 0 -> null
        database_name          = "db"
      ~ id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-messages-reminder-mongodb-account/mongodbDatabases/db/collections/reminder-sharded-new" -> (known after apply)
        name                   = "reminder-sharded-new"
        resource_group_name    = "io-p-itn-com-rg-01"
      + shard_key              = "shard" # forces replacement
      ~ system_indexes         = [
          - {
              - keys   = [
                  - "_id",
                ]
              - unique = true
            },
        ] -> (known after apply)
      ~ throughput             = 0 -> (known after apply)

        index {
            keys   = [
                "_id",
            ]
            unique = true
        }
        index {
            keys   = [
                "content_paymentData_dueDate",
            ]
            unique = false
        }
        index {
            keys   = [
                "content_paymentData_noticeNumber",
                "content_paymentData_payeeFiscalCode",
            ]
            unique = false
        }
        index {
            keys   = [
                "content_type",
            ]
            unique = false
        }
        index {
            keys   = [
                "dueDate",
            ]
            unique = false
        }
      - index {
          - keys   = [
              - "fiscalCode",
            ] -> null
          - unique = false -> null
        }
        index {
            keys   = [
                "insertionDate",
            ]
            unique = false
        }
        index {
            keys   = [
                "lastDateReminder",
            ]
            unique = false
        }
        index {
            keys   = [
                "maxPaidMessageSend",
            ]
            unique = false
        }
        index {
            keys   = [
            ]
            unique = false
        }
        index {
            keys   = [
                "paidFlag",
            ]
            unique = false
        }
        index {
            keys   = [
                "readFlag",
            ]
            unique = false
        }
        index {
            keys   = [
                "rptId",
            ]
            unique = false
        }
      - index {
          - keys   = [
              - "shard",
              - "rptId",
            ] -> null
          - unique = false -> null
        }
        index {
            keys   = [
                "shard",
            ]
            unique = false
        }

      + timeouts {}
    }

  # module.web_apps.module.remote_content_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-rc-func-01] Health Check Failed"
        name                     = "io-p-itn-com-rc-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 10 to import, 6 to add, 5 to change, 1 to destroy.
```

</details>
